In [1]:
%load_ext sql

connecting to the database

In [2]:
%%sql

sqlite:///CourseData.db

'Connected: @CourseData.db'

We choose. Omari Ansong as our random Instructor ID to test our database, this will show us her information as an instructor.

In [10]:
%%sql

SELECT * 
FROM INSTRUCTOR 
WHERE IID = 89;

 * sqlite:///CourseData.db
Done.

[(89, 'Omari   Ansong')]

How many classes did Omari teach over the different semesters?

In [22]:
%%sql

SELECT  *
FROM OFFERINGS_COURSE
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(None, 0)]

Lets see if our database will show the different classes that Anita teaches. We will only show 15 to save some time.

In [5]:
%%sql

SELECT COID, CRN, CatalogID, Title, Term
FROM COURSE_OFFERINGS
WHERE IID = 89
LIMIT 15;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such table: COURSE_OFFERINGS
[SQL: SELECT COID, CRN, CatalogID, Title, Term
FROM COURSE_OFFERINGS
WHERE IID = 89
LIMIT 15;]
(Background on this error at: http://sqlalche.me/e/e3q8)

Omari taugt 10 classes during his time from Fall 2014 to Summer 2018.

In [6]:
%%sql

SELECT COUNT (DISTINCT CRN) AS Classes FROM COURSE_OFFERINGS JOIN COURSE_MEETINGS USING (CRN) WHERE IID = 89;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such table: COURSE_OFFERINGS
[SQL: SELECT COUNT (DISTINCT CRN) AS Classes FROM COURSE_OFFERINGS JOIN COURSE_MEETINGS USING (CRN) WHERE IID = 89;]
(Background on this error at: http://sqlalche.me/e/e3q8)

Omari is a Chemestry teacher, so his classes would mostly be in Bannow as we see below.

In [11]:
%%sql

SELECT DISTINCT Location, COUNT(*)
FROM LOCATION l
INNER JOIN COURSE_MEETINGS m ON l.LID=m.LID
INNER JOIN COURSE_OFFERINGS z ON m.CRN=z.CRN
WHERE IID = 89
GROUP BY Location;

 * sqlite:///CourseData.db
Done.

[('BNW 339', 58),
 ('BNW 341', 26),
 ('BNW 361', 40),
 ('BNW 362', 13),
 ('BNW 363', 26),
 ('BNW GR22', 27),
 ('CMC ', 14)]

We can conclude that Omari Ansong is a Chemestry teacher and teaches his classes in Bannow, and teaches 10 different classes over the corse of 4 years.